Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Pumpen zum Aufpumpen von Luftreifen
en: Pumps for inflating pneumatic tyres

source: Vorlaufachsen zur Verteilung der Fahrzeuglast
en: Pusher axles for altering vehicle payload

source: Hydraulische Kupplungen für Landfahrzeuge
en: Hydraulic clutches for land vehicles

source: Hydraulische Rotationsdämpfer für Fahrzeuge
en: Hydraulic rotary shock absorbers for vehicles

source: Schiebedächer für Landfahrzeuge
en: Sliding roofs for land vehicles

source: Gurte für Kindersportwagen
en: Harnesses for use with pushchairs

source: Kopfstützen für Fahrzeuge
en: Head restraints for vehicles

source: Ladebordwände [Teile von Landfahrzeugen]
en: Tailboard lifts [parts of land vehicles]

source: Transportmittel mit Rädern für Babys
en: Wheeled transporters for babies

source: Kupplungshebel für Landfahrzeuge
en: Clutch levers for land vehicles

source: Gepäckträger für Fahrräder
en: Luggage carriers for cycles

source: Schmutzfängerklammern als Teile von Fahrzeugen
en: Mud flap brackets as structural parts of vehicles

source: Ferngesteuerte Fahrzeuge [ausgenommen Spielzeuge]
en: Remote control vehicles, other than toys

source: Motorboote
en: Powerboats

source: Hydraulische Servoventile als Teile von Fahrzeughydraulikanlagen
en: Hydraulic servo valves being parts of vehicle hydraulic systems

source: Staudruckturbinen für Landfahrzeuge
en: Ram air turbines for land vehicles

source: Federn für Fahrzeugaufhängungen
en: Springs for vehicle suspension systems

source: Angepasste Sitzbezüge für Kraftfahrzeuge
en: Seat covers [shaped] for use in automobiles

source: Zugmaschinen
en: Towing trucks

source: Kopfstützen für Fahrzeugsitze
en: Head-rests for vehicle seats

source: Achsen für Landfahrzeuge
en: Shafts for land vehicles

source: Bremsscheiben für Fahrzeuge
en: Brake discs for vehicles

source: Flickmaterial für Reifenschläuche
en: Patching materials for inner tubes for tyres

source: Landfahrzeuge mit Tretantrieb
en: Pedal driven land vehicles

source: Torsions- und Domstreben [Aufhängungsteile für Landfahrzeuge]
en: Torsion/sway bars [land vehicle suspension parts]

source: Personenwagen [Schienenfahrzeuge]
en: Passenger carriages [rail vehicles]

source: Schraubpropellor für Fahrzeuge
en: Screw propellers for vehicles

source: Turbinen für Landfahrzeuge
en: Turbines for land vehicles

source: Hydraulikturbinen für Landfahrzeuge
en: Hydraulic turbines for land vehicles

source: Bremsbelag für Kraftfahrzeuge
en: Brake linings for motor cars

source: Holzsitze für Fahrzeuge
en: Wooden seats for vehicles

source: Gabelstapler
en: Forklift trucks

source: Gliederketten für Antriebszwecke [für Landfahrzeuge]
en: Link chains for driving purposes [for land vehicles]

source: Fahrzeuge für Tiertransporte
en: Vehicles for animal transport

source: Ferngesteuerte [fahrerlose] Traktoren zum Handhaben von Material
en: Automatically guided [driverless] material handling tractors

source: Antriebsketten für Kraftfahrzeuge
en: Automobile chains [driving]

source: Scheibenwischer für Automobile
en: Windscreen wipers for motor cars

source: Kraftstofftanks für Fahrzeuge
en: Petrol tanks for vehicles

source: Angepasste Abdeckungen für Boote und Wasserfahrzeuge
en: Fitted covers for boats and marine vehicles

source: Raketenabschussrampen [Fahrzeuge]
en: Rocket launching platforms [vehicles]

source: Gasmotoren für Landfahrzeuge
en: Gas engines for land vehicles

source: Stoßdämpfer für die Aufhängungsvorrichtungen von Fahrzeugen
en: Shock absorbers for the suspension units of vehicles

source: Traktoren
en: Tractors

source: Schneeketten [Teile von Landfahrzeugen]
en: Tire snow chains [land vehicle parts]

source: Jollen
en: Skiffs

source: Fahrzeuge für körperbehinderte Personen und Personen mit eingeschränkter Beweglichkeit
en: Vehicles for the physically handicapped and those of reduced mobility

source: Motorisierte und computerisierte Golfkarren
en: Motorized and computerized golf carts

source: Motorisierte und nicht motorisierte Roller zur Beförderung von Personen
en: Motorized and non-motorized scooters for personal transportation

source: Antriebsketten für Straßenfahrzeuge
en: Chains for driving road vehicles

source: Karren [Fahrzeuge]
en: Trolleys [vehicles]

source: Elektrisch betriebene Kraftfahrzeuge
en: Electrically powered motor vehicles

source: Apparate, Maschinen und Geräte für die Luftfahrt
en: Aeronautical apparatus, machines and appliances

source: Dachgepäckträger in Form von Lastträgern für Fahrzeuge
en: Roof racks in the nature of load carriers for vehicles

source: Reifen für Motorräder
en: Tyres for motorcycles

source: Karosserien für Landfahrzeuge
en: Bodies for land vehicles

source: Fahrradzubehör für die Mitnahme von Getränken
en: Fittings for bicycles for carrying beverages

source: Nebelhörner für Fahrzeuge
en: Fog horns for use on vehicles

source: Gabeln für Gabelstapler
en: Forks for fork lift trucks

source: Fahrzeuge für militärische Zwecke
en: Vehicles adapted for military purposes

source: Elektrische Diebstahlschutzanlagen für Fahrzeuge
en: Electrical anti-theft installations for vehicles

source: Anhängerkupplungen aus Metall für Fahrzeuge
en: Towing hitches of metal for vehicles

source: Schalenrümpfe für Fahrzeuge
en: Monocoque structures for vehicles

source: Wellenkupplungen für Landfahrzeuge
en: Shaft couplings for land vehicles

source: Kettenschutz für Fahrräder
en: Chain guards for bicycles

source: Antriebsmotoren für Landfahrzeuge
en: Motor drive units for land vehicles

source: Pneumatische Reifen und Reifenschläuche für Motorräder
en: Pneumatic tyres and inner tubes for motorcycles

source: Bauteile von Fahrzeugbremsen
en: Components for brakes for vehicles

source: Radbremszylinder für Fahrzeuge
en: Wheel cylinders for vehicles

source: Nockenwellen für Landfahrzeuge
en: Camshafts for land vehicles

source: Reifenschläuche [für motorisierte Zweiräder oder Fahrräder]
en: Inner tubes [for two-wheeled motor vehicles or bicycles]

source: Gepäckträger für die Motorhaube
en: Luggage racks fitted to the bonnet

source: Flugzeugträger
en: Aircraft carriers

source: Sattelschlepper
en: Truck tractors

source: Aerodynamische Fahrzeugverkleidungen
en: Aero-dynamic fairings for vehicles

source: Tragflächen für Luftfahrzeuge
en: Aerofoils for air vehicles

source: Aerodynamische Flugzeugtragflächen
en: Aerodynamic wings for airplanes

source: Getrieberäder [Fahrradteile]
en: Gear wheels [bicycle parts]

source: Bremspedale [Teile von Motorrädern]
en: Brake pedals [parts of motorcycles]

source: Stoßdämpfer für Lenker [Motorradteile]
en: Handle bar dampers [parts of motorcycles]

source: Fischerboote
en: Fishing boats

source: Bremsbacken für Landfahrzeuge
en: Brake shoes for land vehicles

source: Traktorgezogene Landfahrzeuge
en: Tractor drawn land vehicles

source: Alarmgeräte für Kraftfahrzeuge
en: Alarms for motor vehicles

source: Bullaugenverschlüsse für Schiffe
en: Marine porthole window closures

source: Metallmasten für Wasserfahrzeuge
en: Metal masts for watercraft

source: Gummireifenprofile zum Gebrauch für runderneuerte Reifen
en: Rubber tread patterns for use in retreading tyres

source: Kraftübertragungsriemen für Landfahrzeuge
en: Power transmission parts [belts] for land vehicles

source: Elektrische Stehrollstühle
en: Powered stand up wheelchairs

source: Kraftbetriebene Luftfahrzeuge
en: Powered vehicles for use in the air

source: Tabletts als Teile von Fahrzeugsitzen
en: Seat trays adapted for use in vehicles

source: Schutzhauben für Fahrzeuge [angepasst]
en: Protective shrouds for vehicles [shaped]

source: Rollstühle
en: Wheelchairs

source: Transportkarren für den Transport von Waren
en: Wheeled containers for the transport of goods

source: Reifen für Einkaufswagen
en: Wheels for supermarket trolleys

source: Flickzeug für Reifenschläuche
en: Repair outfits for inner tubes

source: Diebstahlsicherungen für Fahrzeuge
en: Anti-theft devices for vehicles

source: Antriebseinheiten für Landfahrzeuge
en: Drive units for land vehicles

source: Fahrtrichtungsanzeiger für Fahrräder
en: Direction indicators for bicycles

source: Paddelboote
en: Paddle boats

source: Fahrtrichtungsanzeiger für Fahrzeuge [ausgenommen Lampen]
en: Indicators for indicating direction of vehicles [other than lamps]

source: Aufblasbare Fahrzeugsitze
en: Inflatable seats for vehicles

source: Schienenwagen für Passagiere
en: Railtrucks for passengers

source: Antistatische Streifen für Fahrzeuge
en: Anti-static strips for vehicles

source: Armstützen für Fahrzeuge
en: Arm rests for vehicles

source: Bezüge für Fahrradsättel
en: Saddle covers for bicycles

source: Bezüge für Motorradsättel
en: Saddle covers for motorcycles

source: Sattelstützen als Fahrzeugteile
en: Seat pillars [parts of vehicles]

source: Abdeckhauben für Anhänger
en: Canopies for trailers

source: Karosserieteile im Set zum Anbau an Fahrzeuge
en: Car body modification parts for sale in kit form

source: Vinyldächer für Fahrzeuge
en: Vinyl roofs for vehicles

source: Düsenflugzeuge
en: Jet aircraft

source: Steuerräder für Fahrzeuge
en: Steering wheels for vehicles

source: Schlauchlose Fahrradreifen
en: Tubeless tyres for bicycles

source: Fahrzeugsicherheitsgurte für Babytragetaschen
en: Vehicle safety harness for carry cots

source: Räder [Teile von Landfahrzeugen]
en: Wheels [land vehicle parts]

source: Marine Fahrzeuge
en: Marine vehicles

source: Reifen für Kinderfahrräder
en: Tires for children's bicycles

source: Schutzstreifen mit reflektorischen Einlagen für Fahrzeugtüren
en: Protecting strips with reflective inlays for vehicle doors

source: Spieren als Teile von Wasserfahrzeugen
en: Spars being parts of watercraft

source: Bremsbeläge für Fahrzeuge
en: Brake linings for vehicles

source: Flicken zur Reparatur von Fahrzeugreifen
en: Patches for repairing vehicles tires

source: Stoßdämpfer für Motorräder
en: Shock absorbers for motorcycles

source: Fahrzeuge
en: Vehicles

source: Flaschenhalter für Fahrräder
en: Water bottle cages for bicycles

source: Einbruchsalarmanlagen für Kraftfahrzeuge
en: Intruder detecting alarms for vehicles

source: Schrägaufzüge für Schiffe
en: Inclined ways for boats

source: Scooter [Fahrzeuge]
en: Scooters [vehicles]

source: Getriebegehäuse für Fahrzeuge auf dem Lande
en: Transmission cases for land vehicles

source: Fernalarmgeräte für Wasserfahrzeuge
en: Remote alarms for water vehicles

source: Ferngesteuerte [fahrerlose] Lastwagen zum Handhaben von Material
en: Automatically guided [driverless] material handling trucks

source: Tankdeckel für Fahrzeuge
en: Petrol caps for vehicles

source: Alarmgeber auf Ultraschallbasis für Rückfahrwarngeräte für Fahrzeuge
en: Reversing alarm transmitters utilising ultrasonics for use on vehicles

source: Kraftstofftankdichtungen für Landfahrzeuge
en: Gas tanks grommets for land vehicles

source: Unbemannte Fahrzeuge
en: Unmanned vehicles

source: Kastenwagen [Fahrzeuge]
en: Caissons [vehicles]

source: Scheuerleisten für Wasserfahrzeuge
en: Rub rails for marine vessels

source: Kleinbusse
en: Minibuses

source: Treibriemen zum Antrieb von Landfahrzeugen
en: Drive belts for driving land vehicles

source: Antriebsgetriebe für Landfahrzeuge
en: Drive transmissions for land vehicles

source: Zahnräder für Landfahrzeuge
en: Gear wheels for land vehicles

source: Glasfrontscheiben für Fahrzeuge
en: Glass screens for vehicles

source: Angepasste Abdeckungen für Kleintransporter
en: Covers (Shaped -) for pick-up trucks

source: Elektrisch angetriebene Landfahrzeuge
en: Electrically powered land vehicles

source: Gewehrablagen zum Anbau an Landfahrzeugen
en: Gun racks adapted for attachment to land vehicles

source: Seitentüren für Fahrzeuge
en: Side doors for vehicles

source: Boote zum Verkauf in Bauteilen
en: Boats for sale in kit form

source: Fußpumpen zum Aufpumpen von Fahrzeugreifen
en: Foot pumps for inflating vehicle tyres

source: Luftfedern für Teile von Fahrzeugkarosserien zum Federn von Fahrersitzen und -kabinen
en: Air springs for vehicle suspension components for cushioning driver's seats and cabs

source: Achsen und Gelenkwellen für Kraftfahrzeuge
en: Axles and cardan shaft for motor vehicles

source: Getriebeeinheiten für Landfahrzeuge
en: Gear units for land vehicles

source: Naben für Fahrzeugräder [Motorräder]
en: Hubs for vehicle wheels (motorcycles)

source: Gleitrollen [Fahrzeugräder]
en: Casters [wheels] for vehicles

source: Wendeherzen für Landfahrzeuge
en: Tumbler gears for land vehicles

source: Drehgriffe für Motorräder
en: Twist grips for motorcycles

source: Alarmgeräte für Fahrzeuge
en: Alarm instruments for vehicles

source: Trommelbremsen für Fahrzeuge
en: Brake drums for vehicles

source: Bremsbeläge für Fahrwerke von Luftfahrzeugen
en: Brake linings for aircraft landing gear

source: Ferngesteuerte Unterwasserfahrzeuge
en: Sub-sea remotely operated vehicles

source: Fahrradzubehör für die Mitnahme von Gepäck
en: Fittings for bicycles for carrying luggage

source: Motorantriebe für Landfahrzeuge
en: Motor drive mechanisms for land vehicles

source: Kleine Wagen für Kinder
en: Small wagons for children

source: Tragarme für Drahtseilbahnen
en: Suspension arms for cable cars

source: Aufhängungsfedern für Kraftfahrzeuge
en: Suspension springs for motor cars

source: Sperrballons
en: Barrage balloons

source: Paketregale für Fahrzeuge
en: Parcel shelves for vehicles

source: Antiblockierbremssysteme und -komponenten
en: Antilock brake systems and components

source: Vorderradgabelgelenke [Fahrradteile]
en: Front fork joints [bicycle parts]

source: Elektromotoren für Kraftfahrzeuge
en: Electric motors for motor cars

source: Getriebe für Fahrzeuge
en: Gears for vehicles

source: Transportbehältnisse für Tiere in Form von Karosserien
en: Animal transport containers in the nature of vehicle bodies

source: Segelboot
en: Sailboats

source: Mechanische Transportwagen
en: Mechanical handling trucks

source: Ständer als Teile von Fahrrädern
en: Stands for bicycles [parts of]

source: Dampfschiffe
en: Steamboats

source: Keilwellenschafteinsätze [Teile von Landfahrzeuggetrieben]
en: Spline shank bits [parts of land vehicle gearing]

source: Spoiler für Luftfahrzeuge
en: Spoilers for air vehicles

source: Kraftübertragungsteile für Landfahrzeuge [ausgenommen Treibriemen]
en: Power transmission parts [other than belts] for land vehicles

source: Kraftbetriebene Landfahrzeuge
en: Powered vehicles for use on land

source: Propeller für Luftfahrzeuge
en: Propellers for air vehicles

source: Hydraulikkupplungen mit eingebauten Klappen für Landfahrzeuge
en: Hydraulic couplings with integral dampers, for land vehicles

source: Wärmekraftmotoren für Landfahrzeuge
en: Heat engines for land vehicles

source: Pneumatische Getriebesteuerungen für Landfahrzeuge
en: Pneumatic transmission control units for land vehicles

source: Transmissionsriemen für Landfahrzeuge
en: Transmission belts for land vehicles

source: Hydraulikkreisläufe für Fahrzeuge
en: Hydraulic circuits for vehicles

source: Räder für Luftfahrzeuge
en: Wheels for aircraft

source: Räder für Rennwagen
en: Wheels for racing karts

source: Kindersitzerhöhungen für Fahrzeugsitze
en: Child booster cushions for vehicle seats

source: Kupplungsscheiben für Landfahrzeuge
en: Clutch disks for land vehicles

source: Kupplungsscheiben, ausgenommen für Landfahrzeuge
en: Clutch disks, other than for land vehicles

source: Handbetätigte Rollstühle
en: Manually operated wheelchairs

source: Diebstahlwarngeräte für Fahrzeuge
en: Anti-theft alarms for vehicles

source: Fahrerlose Transportfahrzeuge
en: Driverless transporter vehicles

source: Gleitrollen für Einkaufswagen [Fahrzeuge]
en: Casters for trolleys [vehicles] [carts (Am.)]

source: Klappverdecke für Kraftfahrzeuge
en: Motor car convertible tops

source: Stützständer für Motorräder
en: Stands for motorcycles

source: Fallschirme
en: Parachutes

source: Radzierkappen für Fahrzeuge
en: Ornamental hub caps for vehicles

source: Hydraulische Getriebe für Landfahrzeuge
en: Hydraulic transmissions for land vehicles

source: Aufblasbare Airbags zur Verwendung in Kraftfahrzeugen zur Verhütung von Verletzungen oder Unfällen
en: Inflatable air bags for use in vehicles for the prevention of injury in accidents

source: Kühlergrills aus Metall für Fahrzeuge
en: Radiator grills of metal for vehicles

source: Gepanzerte Landfahrzeuge
en: Armour protected land vehicles

source: Gepanzerte Fahrzeugkarosserien
en: Armoured bodies for vehicles

source: Flugzeugsitzkissen [Fahrzeugsitze]
en: Seat cushions for the seats of aircraft

source: Anhänger für Tankwagen
en: Trailers for petrol tankers

source: Getriebe für Fahrzeuge auf dem Land
en: Transmission gears for land vehicles

source: Rollwagen für die Inspektion der Unterseite von Fahrzeugen
en: Car creepers for use in inspecting the underneath of cars

source: Sonnenblenden für Automobile
en: Sun-blinds adapted for automobiles

source: Sonnenblenden [Fahrzeugteile]
en: Sun visors [vehicle parts]

source: Achsen für Blattfederaufhängung in Fahrzeugen
en: Axles for leaf spring suspensions in vehicles

source: Achsen für Blattfederaufhängungssysteme in Fahrzeugen
en: Axles for leaf spring suspensions systems in vehicles

source: Dreiräder
en: Tricycles

source: Demontierbare Kugelhaken für Fahrzeuge
en: Removable ball hooks for vehicles

source: Ölbehälter aus Metall [Fahrzeugteile]
en: Reservoirs (metal -) [parts of vehicles]

source: Behälter als Teile von Fahrzeugbremsanlagen
en: Reservoirs being parts of vehicle braking systems

source: Stufenrädergetriebe [Fahrradteile]
en: Change-speed gears [bicycle parts]

source: Angepasste Eckenschützer für Transportwagen
en: Protective corners adapted for trolleys

source: Raumfahrzeuge
en: Space vehicles

source: Schalthebel für Landfahrzeuge
en: Speed gear levers for land vehicles

source: Dieselmotoren für Landfahrzeuge
en: Diesel engines for land vehicles

source: Bandbremsen [für Landfahrzeuge]
en: Band brakes for land vehicles

source: Bremsbacken für Kraftfahrzeuge
en: Brake segments for motor cars

source: Bremsen für Kraftfahrzeuge
en: Brakes for motor cars

source: Windschutzscheiben für Fahrzeugfenster
en: Window glass for vehicle windows

source: Dachboxen für Dachgepäckträger von Landfahrzeugen
en: Roof rack storage containers for land vehicles

source: Isolierte Fahrzeugkarosserien
en: Insulated vehicle bodies

source: Wellen- und Klauenkupplungen für Landfahrzeuge
en: Jaw type shaft couplings for land vehicles

source: Bremsscheiben für Landfahrzeuge
en: Brake rotors for land vehicles

source: Kindersicherheitsgurte für Fahrzeugsitze
en: Child safety harnesses for vehicle seats

source: Bauteile für Hubschrauber
en: Structural parts for helicopters

source: Lastenhebeausrüstungen für Kraftfahrzeuge
en: Load carrying [lifting] attachments for motor vehicles

source: Verstärkte Lenksäulen für Fahrzeuge
en: Reinforced steering columns for vehicles

source: Fernalarmgeräte für Landfahrzeuge
en: Remote alarms for land vehicles

source: Kunststofftragflächen für Flugzeuge
en: Plastic wings for use on aircraft

source: Stoßdämpferzylinder [Fahrzeugteile]
en: Shock absorbing cylinders [parts of vehicles]

source: Stoßdämpferfedern als Teile von Fahrzeugaufhängungen
en: Shock absorbing springs being parts of vehicle suspension

source: Antriebe [Teile von Landfahrzeugen]
en: Drive gears [land vehicle parts]

source: Angepasste Getränkehalter zur Verwendung in Fahrzeugen
en: Drinks holders adapted for use in land vehicles

source: Gartentraktoren für Transportzwecke
en: Garden tractors for transport

source: Kettenblätter für Landfahrzeuge
en: Chainwheels for land vehicles

source: Differenzialgetriebe für Landfahrzeuge
en: Differentials for land vehicles

source: Kupplungen für Kraftfahrzeuge
en: Clutch mechanisms for motor cars

source: Rollwagen zum Transport von medizinischem Bedarfsmaterial
en: Wheeled cabinets for transporting medical supplies

source: Scheibenwischerblätter für Fahrzeuge
en: Windshield wiper blades for vehicles

source: Tankwagen
en: Tank waggons

source: Tanker [Schiffe]
en: Tankers [ships]

source: Dachstreben für Fahrzeuge
en: Roof bars for vehicles

source: Dachkoffer für Fahrzeuge
en: Roof cases for vehicles

source: Hydraulische Rotationsmotoren für Landfahrzeuge
en: Rotary hydraulic motors for land vehicles

source: Türgriffe für Kraftfahrzeuge
en: Automobile door handles

source: Ersatzradhalter für Kraftfahrzeuge
en: Automobile spare wheel holders

source: Sättel für Fahrräder oder Motorräder
en: Saddles for bicycles, cycles or motorcycles

source: Antriebsgehäuse für Landfahrzeuge
en: Gear cases for land vehicles

source: Bremsbeläge für Autos
en: Brake pads for automobiles

source: Angepasste Becherhalter für Kraftfahrzeuge
en: Tumbler holders adapted for use in motor vehicles

source: Turbinenwellen [Teile von Landfahrzeugen]
en: Turbine shafts [parts of land vehicles]

source: Luftstromspoiler für Fahrzeuge
en: Air flow spoilers for vehicles

source: Alarmanlagen für Luftfahrzeuge
en: Alarm systems for aircraft

source: Alarmanlagen für Landfahrzeuge
en: Alarm systems for land vehicles

source: Splittstreufahrzeuge mit Eigenantrieb
en: Self-propelled chip spreading vehicles

source: Lenkgestänge für Fahrzeuge
en: Steering linkages for vehicles

source: Ölwannen als Teile von Landfahrzeuggetrieben
en: Sumps being parts of land vehicle gearboxes

source: Sicherheitskupplungen für Landfahrzeuge
en: Safety couplings for land vehicles

source: Schleudersitze für Flugzeuge
en: Ejector seats for aircraft

source: Ausgleichzylinder für Fahrzeugbremsen
en: Compensating cylinders for vehicle brakes

source: Schläuche [für Reifen von Luftfahrzeugen]
en: Inner tubes [for aircraft wheel tires]

source: Anhängezapfen aus Metall für Fahrzeuge
en: Towing pins of metal for vehicles

source: Paddel für Kanus
en: Paddles for canoes

source: Geländegängige Gabelstapler
en: All-terrain fork-lift trucks

source: Teile von Fahrzeugkarosserien
en: Bodywork parts for vehicles

source: Schiffsteuergeräte [automatische]
en: Steering gears for ships [automatic]

source: Fußclips für Fahrradpedale
en: Toeclips for use on bicycles

source: Hydraulische Vorrichtungen zur Kraftübertragung für Landfahrzeuge
en: Hydraulic power transmission units for land vehicles

source: Schneeketten für Fahrzeugräder
en: Snow chains for vehicle wheels

source: Vollgummireifen für Fahrzeugräder
en: Solid rubber tyres for vehicle wheels

source: Lukendeckel als Teile von Lastkähnen
en: Hatch covers being structural parts of barges

source: Lastschaltgetriebe für Landfahrzeuge
en: Power shift transmissions for land vehicles

source: Schaltknäufe für Fahrzeuge
en: Gear lever knobs for vehicles

source: Drehgestelle für Schwenkachsen von Fahrzeugen
en: Loader swivel axle bogies for vehicles

source: Frontlader [Gabelstapler]
en: Loaders [fork-lift trucks]

source: Drehstabfedern für Kraftfahrzeuge
en: Torsion bars for motor cars

source: Stufen zum Anbau an Landfahrzeuge
en: Steps for attachment to land vehicles

source: Gleitschutzketten für Fahrzeugräder
en: Anti-slide chains for vehicle wheels

source: Abdeckungen für Lautsprecheröffnungen in Fahrzeugen
en: Covers for loudspeaker openings in vehicles

source: Apparate zur Beförderung auf dem Wasser
en: Apparatus for locomotion by water

source: Motorroller
en: Motor scooters

source: Scheibenbremsbeläge für Fahrzeuge
en: Disc brake pads for vehicles

source: Angepasste Überzüge für Fahrzeuglenkräder
en: Fitted covers for vehicle steering wheels

source: Sonnenblenden für Fahrzeugscheiben
en: Visors [strips] for vehicle screens

source: Rückfahrwarngeräte für Fahrzeuge
en: Reversing alarms for vehicles

source: Schornsteine für Lokomotiven
en: Funnels for locomotives
